#### Author : 문범수
#### date : 2023-11-01
#### title : 1105 과제

### 필수과제1
- 시리즈 형태 문법을 직접 작성해서 값이 어떻게 나오는지 확인하기 ( 위의 적힌 문법들 )
- 구글링을 통해 위의 문법 외에 최소 3개 이상 정도 검색해서 해당 문법 설명과 코드 작성해서 표현하기

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df_gm = pd.read_csv('gapminder.tsv', sep='\t')
df_gm

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [3]:
gm_lifeExp = df_gm['lifeExp']
print(type(gm_lifeExp))

<class 'pandas.core.series.Series'>

In [4]:
gm_lifeExp

0       28.801
1       30.332
2       31.997
3       34.020
4       36.088
         ...
1699    62.351
1700    60.377
1701    46.809
1702    39.989
1703    43.487
Name: lifeExp, Length: 1704, dtype: float64

In [5]:
gm_lifeExp.min()

23.599

In [6]:
gm_lifeExp.max()

82.603

In [7]:
gm_lifeExp.median()

60.7125

In [8]:
gm_lifeExp.std()

12.917107415241187

In [9]:
#append는 pandas 2.0부터 삭제
gm_lifeExp = gm_lifeExp.append(pd.Series([12.345, 34.567, 56.789], index=[1704, 1705, 1706]))
gm_lifeExp

C:\Users\munbe\AppData\Local\Temp\ipykernel_1808\3374082484.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  gm_lifeExp = gm_lifeExp.append(pd.Series([12.345, 34.567, 56.789], index=[1704, 1705, 1706]))

0       28.801
1       30.332
2       31.997
3       34.020
4       36.088
         ...
1702    39.989
1703    43.487
1704    12.345
1705    34.567
1706    56.789
Length: 1707, dtype: float64

In [10]:
gm_lifeExp.describe()

count    1707.000000
mean       59.430665
std        12.970204
min        12.345000
25%        48.143000
50%        60.542000
75%        70.840500
max        82.603000
dtype: float64

In [11]:
gm_continent = df_gm['continent']
gm_continent.drop_duplicates()

0         Asia
12      Europe
24      Africa
48    Americas
60     Oceania
Name: continent, dtype: object

In [13]:
gm_lifeExp.sort_values()

1704    12.345
1292    23.599
0       28.801
552     30.000
36      30.015
         ...
1487    81.701
695     81.757
802     82.000
671     82.208
803     82.603
Length: 1707, dtype: float64

In [14]:
stod = df_gm[df_gm['continent'] == 'Asia']['lifeExp'].to_frame()
stod

      lifeExp
0      28.801
1      30.332
2      31.997
3      34.020
4      36.088
...       ...
1675   52.922
1676   55.599
1677   58.020
1678   60.308
1679   62.698

[396 rows x 1 columns]

In [15]:
gm_continent = gm_continent.drop_duplicates()
gm_continent

0         Asia
12      Europe
24      Africa
48    Americas
60     Oceania
Name: continent, dtype: object

In [16]:
#문자열을 대체하는 함수 replace -> Series.replace('현재 문자열', '바꿀 문자열')
#Series 원본을 바꿀 때는 inplace=True 추가
gm_continent2 = gm_continent.replace('Americas', 'America')
gm_continent2

0        Asia
12     Europe
24     Africa
48    America
60    Oceania
Name: continent, dtype: object

In [17]:
#임의의 행을 선택하는 함수 sample -> Series.sample(선택할 행 개수)
print(gm_continent.sample(3))

24      Africa
60     Oceania
48    Americas
Name: continent, dtype: object

In [18]:
#두 series가 같은지 확인하는 함수 equals ->  Series1.equals(series2)
print(gm_continent.equals(gm_continent2))

False